Revit 2024 API
FabricationPart.ProductShortDescription Property
 The product short description of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string ProductShortDescription { get; }
Visual Basic
Public ReadOnly Property ProductShortDescription As String
	Get
Visual C++
public:
property String^ ProductShortDescription {
	String^ get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace